## Import des librairies ##

In [1]:
#Imports librairies de base
import numpy as np
import pandas as pd

#Bibliothèques pour Cross validation

#Affichage de Graphes
from IPython.display import Markdown, display, HTML

## 1. Lecture des données ##

1.1 Charger les données d'apprentissage (Data/passagers.csv) dans un DataFrame nommé train. Afficher 10 exemples.

In [2]:
train=pd.read_csv('Data/passagers.csv', dtype={'PassengerId': np.int})
train.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
720,721,1,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0,1,248727,33.0000,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
858,859,1,3,"Baclini, Mrs. Solomon (Latifa Qurban)",female,24.0,0,3,2666,19.2583,NaN,C
186,187,1,3,"O'Brien, Mrs. Thomas (Johanna ""Hannah"" Godfrey)",female,NaN,1,0,370365,15.5000,NaN,Q
836,837,0,3,"Pasic, Mr. Jakob",male,21.0,0,0,315097,8.6625,NaN,S
73,74,0,3,"Chronopoulos, Mr. Apostolos",male,26.0,1,0,2680,14.4542,NaN,C
323,324,1,2,"Caldwell, Mrs. Albert Francis (Sylvia Mae Harb...",female,22.0,1,1,248738,29.0000,NaN,S
686,687,0,3,"Panula, Mr. Jaako Arnold",male,14.0,4,1,3101295,39.6875,NaN,S
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S

1.2 Charger les données d'apprentissage (Data/test.csv) dans un Dataframe nommé test. Afficher 10 exemples.

In [3]:
test=pd.read_csv('Data/test.csv', dtype={'PassengerId': np.int})
test.sample(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
351,1243,2,"Stokes, Mr. Philip Joseph",male,25.0,0,0,F.C.C. 13540,10.5000,NaN,S
55,947,3,"Rice, Master. Albert",male,10.0,4,1,382652,29.1250,NaN,Q
16,908,2,"Keane, Mr. Daniel",male,35.0,0,0,233734,12.3500,NaN,Q
202,1094,1,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.5250,C62 C64,C
153,1045,3,"Klasen, Mrs. (Hulda Kristina Eugenia Lofqvist)",female,36.0,0,2,350405,12.1833,NaN,S
131,1023,1,"Gracie, Col. Archibald IV",male,53.0,0,0,113780,28.5000,C51,C
168,1060,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,NaN,0,0,17770,27.7208,NaN,C
11,903,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
164,1056,2,"Peruschitz, Rev. Joseph Maria",male,41.0,0,0,237393,13.0000,NaN,S
275,1167,2,"Bryhl, Miss. Dagmar Jenny Ingeborg",female,20.0,1,0,236853,26.0000,NaN,S

1.3 Afficher les informations des deux DataFrames train et Test.

In [4]:
train.info()
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

1.4 Calculer le taux global de survie

In [5]:
train['Survived'].sum() / train['Survived'].count()

0.3838383838383838

#### Question 1 : Quel Travail voyez-vous pour que les données soient prêtes à faire tourner dans un modèle ?
Définir notre norme de données



#### Question 2 : Quelle différence y-a-t'il entre les données train et les données test ? 
Les données de test n'ont pas la colonne survived



#### Question 3 : Quel est le rôle de ces deux sets de données ?
Faire une estimation de nombre potentielle de mort dans le test

## 2. Analyse des features

2.1 Analyser l'effet de la variable Classe sur le taux de survie, en affichant le % de survie par classe

In [6]:
train[['Survived','Pclass']].groupby(['Pclass']).sum() / train[['Survived','Pclass']].groupby(['Pclass']).count() * 100

         Survived
Pclass
1       62.962963
2       47.282609
3       24.236253

2.2 Analyser l'effet de la variable Genre (Sex) sur le taux de survie, en affichant le % de survie par classe

In [7]:
train[['Survived','Sex','Pclass']].groupby(['Sex','Pclass']).sum() / train[['Survived','Sex','Pclass']].groupby(['Sex','Pclass']).count() * 100

                Survived
Sex    Pclass
female 1       96.808511
       2       92.105263
       3       50.000000
male   1       36.885246
       2       15.740741
       3       13.544669

2.3 Calculer une nouvelle colonne FamilySize contenant la taille de la famille, pour les DataFrame train et Test. Afficher pour 10 exemples l'Id du passager, le nom, l'age, le sexe et la taille de la famille.

In [8]:
train['FamilySize'] = train['SibSp'] + train['Parch'] + 1
train[['PassengerId','Name','Age','FamilySize']].head(10)

test['FamilySize'] = test['SibSp'] + test['Parch'] + 1
test[['PassengerId','Name','Age','FamilySize']].head(10)

   PassengerId                                          Name   Age  FamilySize
0          892                              Kelly, Mr. James  34.5           1
1          893              Wilkes, Mrs. James (Ellen Needs)  47.0           2
2          894                     Myles, Mr. Thomas Francis  62.0           1
3          895                              Wirz, Mr. Albert  27.0           1
4          896  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.0           3
5          897                    Svensson, Mr. Johan Cervin  14.0           1
6          898                          Connolly, Miss. Kate  30.0           1
7          899                  Caldwell, Mr. Albert Francis  26.0           3
8          900     Abrahim, Mrs. Joseph (Sophie Halaut Easu)  18.0           1
9          901                       Davies, Mr. John Samuel  21.0           3

2.4 Visualisez le nombre de personnes et le taux de survie par taille de famille.

In [9]:
train[['FamilySize','Survived']].groupby(['FamilySize']).mean()

            Survived
FamilySize
1           0.303538
2           0.552795
3           0.578431
4           0.724138
5           0.200000
6           0.136364
7           0.333333
8           0.000000
11          0.000000

2.5 Calculer une nouvelle colonne IsAlone indiquant si le passager est seul ou pas, pour les DataFrame train et Test. Afficher pour 10 exemples l'Id du passager, le nom, l'age, le sexe et le status IsAlone.

In [10]:
train['isAlone'] = train['FamilySize'].map( lambda x: x == 1)
train[['PassengerId','Name','Age','Sex', 'isAlone']].head(10)

test['isAlone'] = test['FamilySize'].map( lambda x: x == 1)
test[['PassengerId','Name','Age','Sex', 'isAlone']].head(10)

,PassengerId,Name,Age,Sex,isAlone
0,892,"Kelly, Mr. James",34.5,male,True
1,893,"Wilkes, Mrs. James (Ellen Needs)",47.0,female,False
2,894,"Myles, Mr. Thomas Francis",62.0,male,True
3,895,"Wirz, Mr. Albert",27.0,male,True
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,female,False
5,897,"Svensson, Mr. Johan Cervin",14.0,male,True
6,898,"Connolly, Miss. Kate",30.0,female,True
7,899,"Caldwell, Mr. Albert Francis",26.0,male,False
8,900,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",18.0,female,True
9,901,"Davies, Mr. John Samuel",21.0,male,False

2.6 Visualisez le nombre de personnes et le taux de survie par statut seul ou pas.

In [11]:
train[['isAlone','Survived']].groupby(['isAlone']).mean()

         Survived
isAlone
False    0.505650
True     0.303538

### Question 1 : La variable Classe est-elle utile pour prévoir la survie ? Pourquoi ?
Oui, 


### Question 2 : Même question pour la variable Sex 
Oui, car les femmes et les enfants sont les premiers à être évacués

### Question 3 : Comment traiter le variables liées à la famille du passager ?
Je ne sais pas

## 3. Traitement des données manquantes (à faire sur les données Train et Test)

3.1 La variable "Embarked" possède des valeurs nulles, compléter par la valeur majoritaire (S).

In [13]:
train['Embarked'].fillna('S', inplace=True)
train.sample(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,isAlone
292,293,0,2,"Levy, Mr. Rene Jacques",male,36.0,0,0,SC/Paris 2163,12.8750,D,C,1,True
398,399,0,2,"Pain, Dr. Alfred",male,23.0,0,0,244278,10.5000,NaN,S,1,True
798,799,0,3,"Ibrahim Shawah, Mr. Yousseff",male,30.0,0,0,2685,7.2292,NaN,C,1,True
391,392,1,3,"Jansson, Mr. Carl Olof",male,21.0,0,0,350034,7.7958,NaN,S,1,True
447,448,1,1,"Seward, Mr. Frederic Kimber",male,34.0,0,0,113794,26.5500,NaN,S,1,True
408,409,0,3,"Birkeland, Mr. Hans Martin Monsen",male,21.0,0,0,312992,7.7750,NaN,S,1,True
740,741,1,1,"Hawksford, Mr. Walter James",male,NaN,0,0,16988,30.0000,D45,S,1,True
299,300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,2,False
115,116,0,3,"Pekoniemi, Mr. Edvard",male,21.0,0,0,STON/O 2. 3101294,7.9250,NaN,S,1,True
771,772,0,3,"Jensen, Mr. Niels Peder",male,48.0,0,0,350047,7.8542,NaN,S,1,True
230,231,1,1,"Harris, Mrs. Henry Birkhardt (Irene Wallach)",female,35.0,1,0,36973,83.4750,C83,S,2,False
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q,1,True
648,649,0,3,"Willey, Mr. Edward",male,NaN,0,0,S.O./P.P. 751,7.5500,NaN,S,1,True
204,205,1,3,"Cohen, Mr. Gurshon ""Gus""",male,18.0,0,0,A/5 3540,8.0500,NaN,S,1,True
748,749,0,1,"Marvin, Mr. Daniel Warner",male,19.0,1,0,113773,53.1000,D30,S,2,False
123,124,1,2,"Webber, Miss. Susan",female,32.5,0,0,27267,13.0000,E101,S,1,True
77,78,0,3,"Moutal, Mr. Rahamin Haim",male,NaN,0,0,374746,8.0500,NaN,S,1,True
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S,1,True
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q,6,False
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,1,True

3.2 Afficher l'influence du port d'embarquement sur la Survie

In [17]:
train[['Embarked','Survived']].groupby(['Embarked']).mean() * 100

           Survived
Embarked
C         55.357143
Q         38.961039
S         33.900929

3.3 La variable "Fare" (prix du ticket) possède des valeurs manquantes. Remplacer ces valeurs par la valeur médiane.

In [48]:
fareMedian=train[['Fare']].median()
train[['Fare']].fillna(fareMedian, inplace=True)

0

3.4 Créer une variable CategoricalFare Découpant la valeur de ticket en 4 catégories de tailles à peu près égales.

In [26]:
train['CategoricalFare']=pd.qcut(train['Fare'], 4)
train['CategoricalFare']

0       (-0.001, 7.91]
1      (31.0, 512.329]
2       (7.91, 14.454]
3      (31.0, 512.329]
4       (7.91, 14.454]
            ...
886     (7.91, 14.454]
887     (14.454, 31.0]
888     (14.454, 31.0]
889     (14.454, 31.0]
890     (-0.001, 7.91]
Name: CategoricalFare, Length: 891, dtype: category
Categories (4, interval[float64]): [(-0.001, 7.91] < (7.91, 14.454] < (14.454, 31.0] < (31.0, 512.329]]

3.5 Analyser l'effet de ces catégories de prix de ticket sur la survie.

In [29]:
train[['CategoricalFare', 'Survived']].groupby(['CategoricalFare']).mean()

                 Survived
CategoricalFare
(-0.001, 7.91]   0.197309
(7.91, 14.454]   0.303571
(14.454, 31.0]   0.454955
(31.0, 512.329]  0.581081

3.6 Combien de valeurs d'Age manquent ? Complète par des valeurs entières aléatoires entre (moyenne - écart type) et (moyenne + écart type).

In [47]:
train.loc[train["Age"].isna()]['PassengerId'].count()
train['Age'].fillna(np.random.random_integers(train.Age.mean() - train.Age.std(), train.Age.mean() + train.Age.std()), inplace=True)
train.loc[train["Age"].isna()]['PassengerId'].count()

0

3.7 Créer une variable CategoricalAge Découpant la valeur d'age en 5 catégories égales.

In [50]:
train['CategoricalAge']=pd.qcut(train['Age'], 5)
train['CategoricalAge']

0       (20.0, 23.0]
1       (28.0, 38.0]
2       (23.0, 28.0]
3       (28.0, 38.0]
4       (28.0, 38.0]
           ...
886     (23.0, 28.0]
887    (0.419, 20.0]
888     (20.0, 23.0]
889     (23.0, 28.0]
890     (28.0, 38.0]
Name: CategoricalAge, Length: 891, dtype: category
Categories (5, interval[float64]): [(0.419, 20.0] < (20.0, 23.0] < (23.0, 28.0] < (28.0, 38.0] < (38.0, 80.0]]

3.8 Analyser l'effet de ces catégories de prix de l'age sur la survie.

In [52]:
train[['CategoricalAge', 'Survived']].groupby(['CategoricalAge']).mean() * 100

                 Survived
CategoricalAge
(0.419, 20.0]   45.810056
(20.0, 23.0]    29.918033
(23.0, 28.0]    38.793103
(28.0, 38.0]    43.428571
(38.0, 80.0]    37.288136

### Question 1 : Classer les variables par ordre d'intérêt
Le sexe, l'age, la pclass ,la prix du ticket, l'embarquement

## 4 : Traitement de features complexes (Optionnel)

4.1 : Le nom permet de retrouver le titre du passager. Trouver les titres lorsqu'ils existent.

In [88]:
train['PassengerTitle']=train['Name'].map(lambda x: x.split(', ')[1].split('.')[0])

4.2 : En utilisant la fonction pandas crosstab, afficher pour train le nombre d'occurences par titres (en ligne) et par sexe (en colonne)

In [89]:
pd.crosstab(train['PassengerTitle'], train['Sex'])

Sex             female  male
PassengerTitle
Capt                 0     1
Col                  0     2
Don                  0     1
Dr                   1     6
Jonkheer             0     1
Lady                 1     0
Major                0     2
Master               0    40
Miss               182     0
Mlle                 2     0
Mme                  1     0
Mr                   0   517
Mrs                125     0
Ms                   1     0
Rev                  0     6
Sir                  0     1
the Countess         1     0

4.3 : 
Remplacer 'Melle et 'Ms' par 'Miss'
Remplacer 'Mme' par 'Mrs'
Creer une valeur "Rare" pour les autres titres avec moins de 10 occurences.

In [98]:
train['PassengerTitle'].replace(to_replace = ['Ms', 'Mlle'], value ='Miss')
train['PassengerTitle'].replace(to_replace = 'Mme', value ='Mrs')
train.loc[train.groupby('PassengerTitle').PassengerTitle.transform('count').lt(10), 'PassengerTitle'] = 'Rare'
train['PassengerTitle']

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886    Rare
887    Miss
888    Miss
889      Mr
890      Mr
Name: PassengerTitle, Length: 891, dtype: object

## 5. Mise en forme des données non numériques

5.1 Attribuer une valeur numérique au Genre. Par exemple 0 pour 'female' et 1 pour 'male'

In [100]:
train['Sex'] = train['Sex'].map({
    'female': 0,
    'male': 1
})

5.2 : Attribuer une valeur pour les possibilités de la variable "Title" ('Master','Miss','Mr','Mrs','Rare').

In [115]:
train['PassengerTitle']=train['PassengerTitle'].map({
    'Master': 1,
    'Miss': 2,
    'Mr': 3,
    'Mrs':4,
    'Rare': 5
})

5.3 Remplacer les titres manquant par 0, et attribuer à la colonne le type entier.

5.4 Attribuer une valeur numérique aux 4 catégories de la variable Fare (question 3.4)

In [106]:
category_fare = train['CategoricalFare'].unique()
train['CategoricalFare'] = train['CategoricalFare'].map({category_fare[0]:1, category_fare[1]:2, category_fare[2]:3, category_fare[3]:4})

5.5 Attribuer une valeur numérique aux 5 catégories de la variable Age (question 3.7)

In [108]:
category_age = train['CategoricalAge'].unique()
train['CategoricalAge'] = train['CategoricalAge'].map({category_age[0]:1, category_age[1]:2, category_age[2]:3, category_age[3]:4, category_age[4]:5})

5.6 Attibuer une valeur numérique au Port d'embarquement (Embarked)

In [110]:
train['Embarked']=train['Embarked'].map({
    'C':1,
    'Q':2,
    'S':3
})

5.7 Supprimer les features inutiles

In [111]:
train = train.drop(['Name','Age','SibSp','Parch','Ticket','Cabin','Fare'], axis=1)

5.8 Afficher les infos pour les deux datasets

In [116]:
train.info()
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PassengerId      891 non-null    int64
 1   Survived         891 non-null    int64
 2   Pclass           891 non-null    int64
 3   Sex              891 non-null    int64
 4   Embarked         891 non-null    int64
 5   FamilySize       891 non-null    int64
 6   isAlone          891 non-null    bool
 7   CategoricalFare  891 non-null    category
 8   CategoricalAge   891 non-null    category
 9   PassengerTitle   891 non-null    int64
dtypes: bool(1), category(2), int64(7)
memory usage: 51.8 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
 11  FamilySize   418 non-null    int64
 12  isAlone      418 non-null    bool
dtypes: bool(1), float64(2), int64(5), object(5)
memory usage: 39.7+ KB

# Sauver les deux datasets dans des fichier csv. Eviter d'écrire un index (n° de ligne)

In [119]:
train.to_csv('Data/passagers_after.csv',index=False)

##### Question : Sur combien de questions avez-vous utilisé les conseils ?
0